
## :white_check_mark: Apply Succeeded (image-api-cdk-dev)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/47598)



<pre><code>Apply complete! Resources: 3 added, 0 changed, 2 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD: Reading...
data.aws_caller_identity.pocket-vpc_current_identity_8303C1C9: Reading...
data.aws_region.application_ecs_service_ecs_codedeploy_current_region_A377EAA5: Reading...
data.aws_ssm_parameter.application_pocket_vpc_private_subnets_424C83F8: Reading...
aws_ecr_repository.application_ecs_service_ecr-app_ecr-repo_ABFE17F0: Refreshing state... [id=imageapi-dev-app]
data.aws_ssm_parameter.pocket-vpc_private_subnets_75BAFB11: Reading...
data.aws_route53_zone.application_base_dns_main_hosted_zone_0141FA96: Reading...
data.aws_caller_identity.application_ecs_service_ecs_codedeploy_current_account_110B92B7: Reading...
data.aws_ssm_parameter.application_pocket_vpc_vpc_ssm_param_DD9C7A4F: Reading...
data.aws_region.pocket-vpc_current_region_1602AAD6: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD: Read complete after 0s [id=1037197018]
data.aws_region.application_ecs_service_ecs_codedeploy_current_region_A377EAA5: Read complete after 0s [id=us-east-1]
data.aws_ssm_parameter.pocket-vpc_vpc_ssm_param_17802658: Reading...
data.aws_kms_alias.application_pocket_vpc_secrets_manager_key_2C3C8766: Reading...
data.aws_region.pocket-vpc_current_region_1602AAD6: Read complete after 0s [id=us-east-1]
data.aws_kms_alias.kms_alias: Reading...
data.aws_caller_identity.pocket-vpc_current_identity_8303C1C9: Read complete after 0s [id=410318598490]
data.aws_ssm_parameter.application_pocket_vpc_public_subnets_282A59F4: Reading...
data.aws_caller_identity.application_ecs_service_ecs_codedeploy_current_account_110B92B7: Read complete after 0s [id=410318598490]
data.aws_region.application_pocket_vpc_current_region_7774DA97: Reading...
data.aws_region.application_pocket_vpc_current_region_7774DA97: Read complete after 0s [id=us-east-1]
aws_cloudwatch_log_group.app-log-group: Refreshing state... [id=/Backend/ImageAPI-Dev/ecs/app]
data.aws_ssm_parameter.application_pocket_vpc_vpc_ssm_param_DD9C7A4F: Read complete after 0s [id=/Shared/Vpc]
data.aws_kms_alias.pocket-vpc_secrets_manager_key_BF1637BF: Reading...
data.aws_kms_alias.kms_alias: Read complete after 0s [id=arn:aws:kms:us-east-1:410318598490:alias/aws/secretsmanager]
data.aws_kms_alias.application_pocket_vpc_secrets_manager_key_2C3C8766: Read complete after 0s [id=arn:aws:kms:us-east-1:410318598490:alias/aws/secretsmanager]
aws_codedeploy_app.application_ecs_service_ecs_codedeploy_ecs_code_deploy_C2F7CBCF: Refreshing state... [id=60780966-16de-4849-a820-a87369b6205d:ImageAPI-Dev-ECS]
aws_route53_zone.application_base_dns_subhosted_zone_77521D1C: Refreshing state... [id=Z03583132NRAF74862GF1]
data.aws_ssm_parameter.pocket-vpc_private_subnets_75BAFB11: Read complete after 0s [id=/Shared/PrivateSubnets]
data.aws_ssm_parameter.pocket-vpc_public_subnets_7F9CDB28: Reading...
data.aws_ssm_parameter.application_pocket_vpc_private_subnets_424C83F8: Read complete after 0s [id=/Shared/PrivateSubnets]
data.aws_region.region: Reading...
data.aws_ssm_parameter.application_pocket_vpc_public_subnets_282A59F4: Read complete after 0s [id=/Shared/PublicSubnets]
data.aws_region.region: Read complete after 0s [id=us-east-1]
data.aws_caller_identity.caller: Reading...
data.aws_ssm_parameter.pocket-vpc_vpc_ssm_param_17802658: Read complete after 0s [id=/Shared/Vpc]
data.aws_kms_alias.pocket-vpc_secrets_manager_key_BF1637BF: Read complete after 0s [id=arn:aws:kms:us-east-1:410318598490:alias/aws/secretsmanager]
data.aws_caller_identity.application_pocket_vpc_current_identity_0A422301: Reading...
data.aws_sns_topic.backend_notifications: Reading...
aws_ecs_cluster.application_ecs_cluster_4DC6EFB3: Refreshing state... [id=arn:aws:ecs:us-east-1:410318598490:cluster/ImageAPI-Dev]
data.aws_ssm_parameter.pocket-vpc_public_subnets_7F9CDB28: Read complete after 0s [id=/Shared/PublicSubnets]
data.aws_caller_identity.application_pocket_vpc_current_identity_0A422301: Read complete after 0s [id=410318598490]
aws_cloudwatch_log_group.application_ecs_service_ecs-aws-otel-collector_9F54C4B2: Refreshing state... [id=/ecs/ImageAPI-Dev/aws-otel-collector20231215194825582100000001]
data.aws_caller_identity.caller: Read complete after 0s [id=410318598490]
data.aws_iam_policy_document.application_ecs_service_ecs_codedeploy_codedeploy_assume_role_C76E7224: Reading...
aws_acm_certificate.application_alb_certificate_93966247: Refreshing state... [id=arn:aws:acm:us-east-1:410318598490:certificate/a61e4567-b80c-42e6-a4e3-2928c06cbb41]
data.aws_iam_policy_document.application_ecs_service_ecs_codedeploy_codedeploy_assume_role_C76E7224: Read complete after 0s [id=4250039221]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_ecs-task-assume_05903663: Reading...
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6: Refreshing state... [id=arn:aws:iam::410318598490:policy/ImageAPI-Dev-TaskRolePolicy]
data.aws_sns_topic.backend_notifications: Read complete after 0s [id=arn:aws:sns:us-east-1:410318598490:Backend-Dev-ChatBot]
data.aws_vpc.pocket-vpc_2587E211: Reading...
data.aws_vpc.application_pocket_vpc_22D55D83: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_ecs-task-assume_05903663: Read complete after 0s [id=1077804475]
aws_iam_role.application_ecs_service_ecs_codedeploy_ecs_code_deploy_role_175DB7D3: Refreshing state... [id=ImageAPI-Dev-ECSCodeDeployRole]
aws_ecr_lifecycle_policy.application_ecs_service_ecr-app_ecr-repo-lifecyclepolicy_CCDF75B7: Refreshing state... [id=imageapi-dev-app]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_015FDEBA: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_015FDEBA: Read complete after 0s [id=1695538156]
aws_iam_role.application_ecs_service_ecs-iam_ecs-execution-role_FB754BAA: Refreshing state... [id=ImageAPI-Dev-TaskExecutionRole]
aws_codestarnotifications_notification_rule.application_ecs_service_ecs_codedeploy_ecs_codedeploy_notifications_CB44EADE: Refreshing state... [id=arn:aws:codestar-notifications:us-east-1:410318598490:notificationrule/c23e94a8e956cb73bf142de97dec4778ad86917d]
aws_iam_role.application_ecs_service_ecs-iam_ecs-task-role_A72990ED: Refreshing state... [id=ImageAPI-Dev-TaskRole]
data.aws_route53_zone.application_base_dns_main_hosted_zone_0141FA96: Read complete after 0s [id=ZCSIDA846KWLN]
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77: Refreshing state... [id=arn:aws:iam::410318598490:policy/ImageAPI-Dev-TaskExecutionRolePolicy]
aws_route53_record.application_base_dns_subhosted_zone_ns_DFB88A22: Refreshing state... [id=ZCSIDA846KWLN_image-api.getpocket.dev_NS]
aws_iam_role_policy_attachment.application_ecs_service_ecs_codedeploy_ecs_codedeploy_role_attachment_1A1D5725: Refreshing state... [id=ImageAPI-Dev-ECSCodeDeployRole-2022081000560648580000000c]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-default-attachment_99A621FF: Refreshing state... [id=ImageAPI-Dev-TaskExecutionRole-20220810005606135400000009]
aws_route53_record.application_alb_certificate_certificate_record_51B45CF2: Refreshing state... [id=Z03583132NRAF74862GF1__edda5b7eb97018e5ee423fcac61bdcaa.image-api.getpocket.dev._CNAME]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355: Refreshing state... [id=ImageAPI-Dev-TaskRole-2022081000560641480000000b]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-custom-attachment_046B7E2E: Refreshing state... [id=ImageAPI-Dev-TaskExecutionRole-2022081000560614330000000a]
data.aws_vpc.application_pocket_vpc_22D55D83: Read complete after 1s [id=vpc-012481e83ffa5e152]
aws_alb_target_group.application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:targetgroup/IMGAPI20220810005605471600000006/98aee474d2939426]
data.aws_vpc.pocket-vpc_2587E211: Read complete after 1s [id=vpc-012481e83ffa5e152]
aws_alb_target_group.application_ecs_service_green_target_group_ecs_target_group_4E06DCA6: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:targetgroup/IMGAPI20220810005605339200000003/a89db6f1b67b6575]
data.aws_subnets.application_pocket_vpc_private_subnet_ids_AED9F181: Reading...
data.aws_security_groups.application_pocket_vpc_default_security_groups_4D3B6986: Reading...
aws_security_group.application_application_load_balancer_alb_security_group_7B45D070: Refreshing state... [id=sg-077b5e681bccb35dd]
data.aws_security_groups.application_pocket_vpc_internal_security_groups_8D057D72: Reading...
data.aws_subnets.application_pocket_vpc_public_subnet_ids_4577655C: Reading...
data.aws_vpc.redis_vpc_45DE3471: Reading...
data.aws_subnets.pocket-vpc_private_subnet_ids_73CCA71D: Reading...
data.aws_vpc.serverless_redis_vpc_D4AE9B76: Reading...
data.aws_security_groups.pocket-vpc_default_security_groups_1F0F3778: Reading...
data.aws_subnets.application_pocket_vpc_public_subnet_ids_4577655C: Read complete after 0s [id=us-east-1]
data.aws_security_groups.application_pocket_vpc_default_security_groups_4D3B6986: Read complete after 0s [id=us-east-1]
data.aws_subnets.pocket-vpc_public_subnet_ids_0B13AF23: Reading...
data.aws_security_groups.pocket-vpc_internal_security_groups_147262D8: Reading...
data.aws_security_groups.application_pocket_vpc_internal_security_groups_8D057D72: Read complete after 0s [id=us-east-1]
aws_acm_certificate_validation.application_alb_certificate_certificate_validation_25DAB195: Refreshing state... [id=2022-08-10 00:56:53.299 +0000 UTC]
data.aws_subnets.application_pocket_vpc_private_subnet_ids_AED9F181: Read complete after 0s [id=us-east-1]
aws_security_group.application_ecs_service_ecs_security_group_231C6B1E: Refreshing state... [id=sg-0b690fe67f19bbab6]
data.aws_subnets.pocket-vpc_private_subnet_ids_73CCA71D: Read complete after 0s [id=us-east-1]
aws_alb.application_application_load_balancer_alb_05EA9801: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:loadbalancer/app/IMGAPI2022081000560872550000000d/6d0547acdf48c14f]
data.aws_security_groups.pocket-vpc_default_security_groups_1F0F3778: Read complete after 0s [id=us-east-1]
aws_elasticache_subnet_group.redis_elasticache_subnet_group_EA2B92B2: Refreshing state... [id=imageapi-dev-elasticachesubnetgroup]
data.aws_subnets.pocket-vpc_public_subnet_ids_0B13AF23: Read complete after 0s [id=us-east-1]
data.aws_subnets.cache_private_subnet_ids: Reading...
data.aws_security_groups.pocket-vpc_internal_security_groups_147262D8: Read complete after 0s [id=us-east-1]
data.aws_vpc.redis_vpc_45DE3471: Read complete after 0s [id=vpc-012481e83ffa5e152]
aws_security_group.redis_elasticache_security_group_24BFB83E: Refreshing state... [id=sg-05b3d057301048323]
data.aws_subnets.cache_private_subnet_ids: Read complete after 0s [id=us-east-1]
data.aws_vpc.serverless_redis_vpc_D4AE9B76: Read complete after 0s [id=vpc-012481e83ffa5e152]
aws_security_group.serverless_redis_elasticache_security_group_31FA49DF: Refreshing state... [id=sg-0b11934174451136f]
aws_alb_listener.application_listener_http_D74EC0ED: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:listener/app/IMGAPI2022081000560872550000000d/6d0547acdf48c14f/667a0e26dd82acb8]
aws_alb_listener.application_listener_https_D31CB055: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:listener/app/IMGAPI2022081000560872550000000d/6d0547acdf48c14f/d98d92cd686488c8]
aws_route53_record.application_alb_record_8EA9D3F9: Refreshing state... [id=Z03583132NRAF74862GF1_image-api.getpocket.dev_A_1]
aws_cloudwatch_metric_alarm.application_alarm-httptarget5xxerrorrate_F94D87C0: Refreshing state... [id=ImageAPI-Dev-Alarm-HTTPTarget5xxErrorRate]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Refreshing state... [id=imageapi-dev-serverless]
aws_elasticache_replication_group.redis_elasticache_replication_group_6DE00446: Refreshing state... [id=imageapi-dev]
aws_alb_listener_rule.application_ecs_service_listener_rule_903F815F: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:listener-rule/app/IMGAPI2022081000560872550000000d/6d0547acdf48c14f/d98d92cd686488c8/9cbba2b162b4e5a4]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Refreshing state... [id=ImageAPI-Dev]
local_file.application_ecs_service_appspec_94386B9C: Refreshing state... [id=0a4f0c9138a69900924f0a0b13874b60f95d261d]
aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4: Refreshing state... [id=arn:aws:ecs:us-east-1:410318598490:service/ImageAPI-Dev/ImageAPI-Dev]
aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99: Refreshing state... [id=service/ImageAPI-Dev/ImageAPI-Dev]
aws_codedeploy_deployment_group.application_ecs_service_ecs_codedeploy_ecs_codedeploy_deployment_group_48384247: Refreshing state... [id=3a7e4b3b-5b26-465e-900f-a81e24e490b4]
aws_cloudwatch_dashboard.application_cloudwatch-dashboard_1F3DC0ED: Refreshing state... [id=ImageAPI-Dev]
aws_appautoscaling_policy.application_autoscaling_scale_out_policy_D03900A2: Refreshing state... [id=ImageAPI-Dev-ScaleOutPolicy]
aws_appautoscaling_policy.application_autoscaling_scale_in_policy_BF273511: Refreshing state... [id=ImageAPI-Dev-ScaleInPolicy]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_in_alarm_850BE3A1: Refreshing state... [id=ImageAPI-Dev Service Low CPU]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_out_alarm_E40FCBA0: Refreshing state... [id=ImageAPI-Dev Service High CPU]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:410318598490:task-definition/ImageAPI-Dev:52" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:410318598490:task-definition/ImageAPI-Dev" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu                    = 0
                  - environment            = [
                      - {
                          - name  = "NODE_ENV"
                          - value = "development"
                        },
                      - {
                          - name  = "OTLP_COLLECTOR_HOST"
                          - value = "localhost"
                        },
                      - {
                          - name  = "REDIS_PRIMARY_ENDPOINT"
                          - value = "imageapi-dev.n7e2yl.ng.0001.use1.cache.amazonaws.com"
                        },
                      - {
                          - name  = "REDIS_READER_ENDPOINT"
                          - value = "imageapi-dev-ro.n7e2yl.ng.0001.use1.cache.amazonaws.com"
                        },
                    ]
                  - essential              = true
                  - healthCheck            = {
                      - command     = [
                          - "CMD-SHELL",
                          - "curl -f http://localhost:4867/.well-known/apollo/server-health || exit 1",
                        ]
                      - interval    = 15
                      - retries     = 3
                      - startPeriod = 0
                      - timeout     = 5
                    }
                  - image                  = "410318598490.dkr.ecr.us-east-1.amazonaws.com/imageapi-dev-app:e7f853e383f5cd65ac9e5c343be5d568ead5ea47"
                  - logConfiguration       = {
                      - logDriver     = "awslogs"
                      - options       = {
                          - awslogs-group             = "/Backend/ImageAPI-Dev/ecs/app"
                          - awslogs-multiline-pattern = "^\\S.+"
                          - awslogs-region            = "us-east-1"
                          - awslogs-stream-prefix     = "ecs"
                        }
                      - secretOptions = []
                    }
                  - mountPoints            = []
                  - name                   = "app"
                  - portMappings           = [
                      - {
                          - containerPort = 4867
                          - hostPort      = 4867
                          - protocol      = "tcp"
                        },
                    ]
                  - readonlyRootFilesystem = false
                  - secrets                = [
                      - {
                          - name      = "IMAGE_CACHE_ENDPOINT"
                          - valueFrom = "arn:aws:ssm:us-east-1:410318598490:parameter/ImageAPI/Dev/IMAGE_CACHE_ENDPOINT"
                        },
                      - {
                          - name      = "SENTRY_DSN"
                          - valueFrom = "arn:aws:ssm:us-east-1:410318598490:parameter/ImageAPI/Dev/SENTRY_DSN"
                        },
                    ]
                  - volumesFrom            = []
                },
              - {
                  - command                = [
                      - "--config=/etc/ecs/ecs-xray.yaml",
                    ]
                  - cpu                    = 0
                  - environment            = []
                  - essential              = true
                  - image                  = "amazon/aws-otel-collector"
                  - logConfiguration       = {
                      - logDriver     = "awslogs"
                      - options       = {
                          - awslogs-group         = "/ecs/ImageAPI-Dev/aws-otel-collector20231215194825582100000001"
                          - awslogs-region        = "us-east-1"
                          - awslogs-stream-prefix = "ecs"
                        }
                      - secretOptions = []
                    }
                  - mountPoints            = []
                  - name                   = "aws-otel-collector"
                  - portMappings           = [
                      - {
                          - containerPort = 4138
                          - hostPort      = 4138
                          - protocol      = "tcp"
                        },
                      - {
                          - containerPort = 4137
                          - hostPort      = 4137
                          - protocol      = "tcp"
                        },
                    ]
                  - readonlyRootFilesystem = false
                  - repositoryCredentials  = {
                      - credentialsParameter = "arn:aws:secretsmanager:us-east-1:410318598490:secret:Shared/DockerHub"
                    }
                  - volumesFrom            = []
                },
            ] # forces replacement
        ) -> (known after apply) # forces replacement
      ~ id                       = "ImageAPI-Dev" -> (known after apply)
      ~ revision                 = 52 -> (known after apply)
        tags                     = {
            "environment" = "Dev"
            "service"     = "ImageAPI"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF must be replaced
-/+ resource "aws_elasticache_serverless_cache" "serverless_redis_elasticache_serverless_356B3FAF" {
      ~ arn                      = "arn:aws:elasticache:us-east-1:410318598490:serverlesscache:imageapi-dev-serverless" -> (known after apply)
      ~ create_time              = "2024-02-12T22:05:17Z" -> (known after apply)
      ~ daily_snapshot_time      = "08:30" -> (known after apply)
      ~ endpoint                 = [
          - {
              - address = "imageapi-dev-serverless-n7e2yl.serverless.use1.cache.amazonaws.com"
              - port    = 6379
            },
        ] -> (known after apply)
      ~ full_engine_version      = "7.1" -> (known after apply)
      ~ id                       = "imageapi-dev-serverless" -> (known after apply)
      ~ major_engine_version     = "7" -> (known after apply)
      ~ name                     = "imageapi-dev-serverless" -> "ImageAPI-Dev-serverless" # forces replacement
      ~ reader_endpoint          = [
          - {
              - address = "imageapi-dev-serverless-n7e2yl.serverless.use1.cache.amazonaws.com"
              - port    = 6380
            },
        ] -> (known after apply)
      ~ snapshot_retention_limit = 0 -> (known after apply)
      ~ status                   = "available" -> (known after apply)
        tags                     = {
            "environment" = "Dev"
            "service"     = "ImageAPI"
        }
        # (5 unchanged attributes hidden)
    }

  # local_file.application_ecs_service_appspec_94386B9C will be created
  + resource "local_file" "application_ecs_service_appspec_94386B9C" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

Plan: 3 to add, 0 to change, 2 to destroy.
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Destroying... [id=ImageAPI-Dev]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Destruction complete after 0s
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Destroying... [id=imageapi-dev-serverless]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Still destroying... [id=imageapi-dev-serverless, 10s elapsed]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Still destroying... [id=imageapi-dev-serverless, 20s elapsed]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Still destroying... [id=imageapi-dev-serverless, 30s elapsed]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Still destroying... [id=imageapi-dev-serverless, 40s elapsed]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Still destroying... [id=imageapi-dev-serverless, 50s elapsed]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Still destroying... [id=imageapi-dev-serverless, 1m0s elapsed]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Still destroying... [id=imageapi-dev-serverless, 1m10s elapsed]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Still destroying... [id=imageapi-dev-serverless, 1m20s elapsed]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Still destroying... [id=imageapi-dev-serverless, 1m30s elapsed]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Still destroying... [id=imageapi-dev-serverless, 1m40s elapsed]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Still destroying... [id=imageapi-dev-serverless, 1m50s elapsed]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Still destroying... [id=imageapi-dev-serverless, 2m0s elapsed]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Still destroying... [id=imageapi-dev-serverless, 2m10s elapsed]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Still destroying... [id=imageapi-dev-serverless, 2m20s elapsed]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Still destroying... [id=imageapi-dev-serverless, 2m30s elapsed]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Still destroying... [id=imageapi-dev-serverless, 2m40s elapsed]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Still destroying... [id=imageapi-dev-serverless, 2m50s elapsed]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Still destroying... [id=imageapi-dev-serverless, 3m0s elapsed]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Still destroying... [id=imageapi-dev-serverless, 3m10s elapsed]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Still destroying... [id=imageapi-dev-serverless, 3m20s elapsed]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Still destroying... [id=imageapi-dev-serverless, 3m30s elapsed]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Destruction complete after 3m32s
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Creating...
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Still creating... [10s elapsed]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Still creating... [20s elapsed]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Still creating... [30s elapsed]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Still creating... [40s elapsed]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Still creating... [50s elapsed]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Still creating... [1m0s elapsed]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Still creating... [1m10s elapsed]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Still creating... [1m20s elapsed]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Still creating... [1m30s elapsed]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Still creating... [1m40s elapsed]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Creation complete after 1m42s [id=imageapi-dev-serverless]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Creating...
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Creation complete after 0s [id=ImageAPI-Dev]
local_file.application_ecs_service_appspec_94386B9C: Creating...
local_file.application_ecs_service_appspec_94386B9C: Creation complete after 0s [id=050d5a30891eff087862a30b491130f293aecf56]

Apply complete! Resources: 3 added, 0 changed, 2 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobID":"1f0e92ef-9df9-4d0d-acd9-65a5b44223c1","JobName":"image-api_infrastructure_apply_dev","PRNumber":167,"Program":"tfcmt","SHA1":"aba1d5cecda603facd9261f1f1b39a2b490401ca","Target":"image-api-cdk-dev","Vars":{}} -->